package eidreceipie.islam.mazharul.eidreceipe;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.util.DisplayMetrics;
import android.util.Log;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.RelativeLayout;
import android.widget.TextView;

public class DetailsCook extends AppCompatActivity {
    TextView tv1,tv2;
    ImageView im1;
    int selector;
    int height,width;
    LinearLayout linearLayout;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_details_cook);
        tv1=(TextView)findViewById(R.id.ingradients);
        tv2=(TextView)findViewById(R.id.work_step);
        im1=(ImageView)findViewById(R.id.imageView);
        linearLayout=(LinearLayout)findViewById(R.id.imageHolder);
        Intent intent=getIntent();
        selector=intent.getIntExtra("position",0)+1;
        Log.d("Selector",">>>>"+selector);
        DisplayMetrics displayMetrics = this.getResources().getDisplayMetrics();
        width = displayMetrics.widthPixels;
        height = displayMetrics.heightPixels;
        final  RelativeLayout.LayoutParams params = (RelativeLayout.LayoutParams) linearLayout.getLayoutParams();
        params.height=height/4;
        linearLayout.setLayoutParams(params);
        tv1.setTextSize(17);
        tv2.setTextSize(17);

        if(selector==1)
        {
            tv1.setText("খাসির মাংস ৬ কেজি (প্রতি কেজিতে ৮ থেকে ১০ টুকরা হবে), লবণ ২৫০ গ্রাম বা কিছুটা বেশি, আদা বাটা ১ কাপ, রসুন বাটা ১ কাপ, দই ২ কাপ, জর্দার রঙ বা জাফরান ২ গ্রাম, দারুচিনি ও এলাচি গুঁড়া দুই চা–চামচ করে, লবঙ্গ কয়েকটা, জয়ত্রী ২ চিমটি, শাহী জিরা আধা চা–চামচ, আস্ত দারুচিনি ও লবঙ্গ কয়েকটা, কাবাব চিনি ১ চা–চামচ, সাদা গোলমরিচের গুঁড়া ২ চা–চামচ, পেস্তা বাদাম ৫০ গ্রাম, তেজপাতা ৫ থেকে ১০টা, গোল আলু ১০টা (প্রতিটা ৪ টুকরা), পেঁয়াজ বেরেস্তা পরিমাণমতো, কালিজিরা চাল ৩ কেজি।");
            tv2.setText("মাংস ধুয়ে নিন। এবার দইয়ের মধ্যে দারুচিনি ও এলাচি গুঁড়া, জর্দার রং মিশিয়ে দইটা মাংসে মেশান। এরপর জয়ত্রী, সাদা গোলমরিচ, আদা-রসুন বাটাসহ বাকি সব মসলা মাংসে মেশান। চালটা আলাদা সেদ্ধ করে নিন। পেঁয়াজ বেরেস্তা করে নিন। আলুর টুকরাগুলো ভেজে নিন। এবার মসলা মাখানো মাংস রান্নার হাঁড়িতে ঢেলে সাজিয়ে নিন। তার ওপর ভাজা আলু ও পেঁয়াজ বেরেস্তা ছড়িয়ে দিন। এবার মাংসের ওপরে সেদ্ধ চাল সমান করে বিছিয়ে নিন। হাঁড়ির নিচে আগুন ও কয়লার দম দিন। হাঁড়ির মুখে ঢাকনা দিয়ে চারপাশ আটা দিয়ে বন্ধ করে দিন। তিন থেকে চার ঘণ্টার মধ্যে তৈরি হয়ে যাবে খাসির কাচ্চি বিরিয়ানি।");
            im1.setBackgroundResource(R.drawable.rec_01);
            setTitle(R.string.rec_01);
        }
        else if(selector==2)
        {
            tv1.setText("খাসির মাংস ৮ কেজি, পোলাওর চাল ৫ কেজি, পেঁয়াজ কুঁচি ২ কেজি, আদা ৪০০ গ্রাম, রসুন ২৫০ গ্রাম, কাঁচা মরিচ ৫০০ গ্রাম, তরল দুধ ১ কেজি, টক দই ১ কেজি, এলাচি ও দারুচিনি ৩০ গ্রাম করে, কাঠবাদাম ৫০০ গ্রাম, কিশমিশ ২৫০ গ্রাম, লবণ ২৫০ গ্রাম, তেল ৩ কেজি, তেজপাতা কয়েকটা।");
            tv2.setText("রান্নার জন্য বড় পাত্র নির্বাচন করুন। মাংস ছোট ছোট টুকরা করে ধুয়ে নিন। চাল ভিজিয়ে রাখুন। রান্নার পাত্রে তেল ঢেলে গরম করে নিন। এবার মোট পেঁয়াজ কুচির তিন ভাগের এক ভাগ তেলে দিয়ে নাড়ুন। কিছুক্ষণ পর আদা ও রসুন বাটা দিয়ে নাড়ুন। মসলা নাড়তে নাড়তে অনেকটা বুন্দিয়ার মতো দানা হয়ে এলে বাকি পেঁয়াজ দিয়ে আবার নাড়ুন। এবার মাংস ঢেলে দিন। সেই সঙ্গে টক দই, দুধ, এলাচি, দারুচিনি, মরিচ, কাঠবাদাম, তেজপাতা, লবণ দিয়ে দিয়ে দিন। এই সময়ে মাংসটা ভালো করে নাড়তে হবে। মাংস সেদ্ধ হয়ে এলে একটা সুন্দর ঘ্রাণ ছড়াবে। এবার মাংসের পাত্রে পর্যাপ্ত পানি দিতে হবে। প্রতি গ্লাস চালের জন্য চার গ্লাস পানি হিসেব করে নিলেই চলবে। পানিটা ফুটে এলে ভিজিয়ে রাখার পর নরম হয়ে আসা চাল দিয়ে দিন। এবার কিছুক্ষণ নেড়ে নিয়ে চুলার আঁচ কমিয়ে দমে দিয়ে রাখুন। ১৫ মিনিট পর পাত্রের ঢাকনা খুলে পুরো চালটা উল্টেপাল্টে দিন। তারপর আবার দমে দিয়ে রাখুন। আধঘণ্টা পর চাল ফুটে গেলে নামিয়ে পরিবেশন করতে পারেন।");
            im1.setBackgroundResource(R.drawable.rec_02);
            setTitle(R.string.rec_02);
        }
        else if(selector==3)
        {
            tv1.setText("হাড্ডি ছাড়া গরুর মাংস কিউব করে নিতে হবে ১ কেজি, নারিকেল পাউডার ২ টেবিল চামচ, ধনে গুঁড়া ১ টেবিল চামচ, জিরা গুঁড়া ২ টেবিল চামচ, গরম মসলা গুঁড়া ১ টেবিল চামচ, মরিচ গুঁড়া ২ টেবিল চামচ, শুকনা মেথিপাতা ১ টেবিল চামচ, গরুর চর্বি ২০০ গ্রাম, পুদিনা পাতা ৫০ গ্রাম, ধনেপাতা ৫০ গ্রাম, কাঁচামরিচ ৫টি, আদা-রসুন আস্ত ২০ গ্রাম।");
            tv2.setText("সব উপকরণ একসঙ্গে মেখে কিমা করে নিতে হবে। তারপর শিকে ভরে কয়লার চুলায় সেঁকতে হবে। বারবার উল্টিয়ে নিতে হবে।");
            im1.setBackgroundResource(R.drawable.rec_03);
            setTitle(R.string.rec_03);
        }
        else if(selector==4)
        {
            tv1.setText("গরুর মাংস ১ কেজি, আদা বাটা ১ চা চামচ, রসুন বাটা আধা চা চামচ, পেঁয়াজ কুচি ১ টেবিল চামচ, দারুচিনি- এলাচ ৩-৪ টুকরা, গোলমরিচ ৩ চা চামচ, বেরেস্তা ২ কাপ, তেজপাতা ২টি, ঘি আধা কাপ, তেল ১ কাপ, কাঁচামরিচ ১২-১৪টি, ফুলকপি আধা কাপ, গাজর আধা কাপ, মটরশুঁটি আধা কাপ, শসা আধা কাপ, আলু আধা কাপ, পটোল আধা কাপ, চাল পৌনে ১ কেজি।");
            tv2.setText("মাংস ছোট ছোট টুকরা করে নিতে হবে। প্যানে তেল দিয়ে তেজপাতা, এলাচ, দারুচিনি, পেঁয়াজ কুচি, আদা বাটা, রসুন বাটা দিয়ে মাংস রান্না করতে হবে। সব সবজি আলাদা আলাদা তেলে ভেজে তুলতে হবে। প্যানে তেল দিয়ে পেঁয়াজ কুচি, আদা, রসুন বাটা দিয়ে চাল কষাতে হবে। পরিমাণ মতো পানি দিতে হবে। যখন ফুটে আসবে তখন সব সবজি ও মাংস মিশিয়ে দিতে হবে। এরপর গোলমরিচ ছিটিয়ে দিয়ে দমে দিতে হবে। রান্না শেষ হলে ঘি ছিটিয়ে পরিবেশন করতে হবে।");
            im1.setBackgroundResource(R.drawable.rec_04);
            setTitle(R.string.rec_04);
        }
        else if(selector==5)
        {
            tv1.setText("গরুর মগজ ১টি, পেঁয়াজ কুচি আধা কাপ, আদা বাটা ১ চা চামচ, রসুন বাটা আধা চা চামচ, হলুদ গুঁড়া ১ চা চামচ, মরিচ গুঁড়া ১ চা চামচ, জিরা গুঁড়া ১ চা চামচ, কাঁচামরিচ ৬-৭টি, এলাচ, দারুচিনি ২-৩ টুকরা, লবণ পরিমাণ মতো, তেল আধা কাপ।");
            tv2.setText("মগজ পরিষ্কার করে নিয়ে আধা ভাঙা করে চটকে নিন। এবার কাঁচামরিচ ও তেল ছাড়া সব উপকরণ একসঙ্গে মেখে নিন। প্যানে তেল গরম করে পেঁয়াজ কুচি দিয়ে লাল করে ভেজে মগজ ছেড়ে দিন। ভালো করে নাড়তে থাকুন। কাঁচামরিচ দিন। সামান্য পানি দিন। পানি শুকিয়ে গেলে যখন তেলের ওপরে উঠে আসবে। তখন নামিয়ে পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_05);
            setTitle(R.string.rec_05);
        }
        else if(selector==6)
        {
            tv1.setText("চিকেন ৪-৫ টুকরা, মসুর/বুটের ডাল ১ কাপ, আদা বাটা ১ চা চামচ, পেঁয়াজ কুচি ২ টেবিল চামচ, হলুদ গুঁড়া ১ চা চামচ, তেল ও লবণ পরিমাণমতো।");
            tv2.setText("চিকেন টুকরাগুলো ভালোভাবে ধুয়ে নিন। চুলায় তেল গরম করে পেঁয়াজ গোল্ডেন ব্রাউন করে ভেজে তাতে চিকেন টুকরা ছেড়ে দিন। একে একে আদা বাটা, হলুদ গুঁড়া ও লবণ দিয়ে কিছুক্ষণ নাড়াচাড়া করে তাতে ৩ কাপ পানি দিন। পানি গরম হলে তাতে ডাল দিয়ে দিন এবং কিছুক্ষণ রান্না করুন। ঘন হয়ে এলে নামিয়ে পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_06);
            setTitle(R.string.rec_06);
        }
        else if(selector==7)
        {
            tv1.setText("মুরগি দেড় কেজি, সয়াবিন তেল ৩০০ গ্রাম, আদা বাটা ৬ চা চামচ, রসুন বাটা ৬ চা চামচ, এলাচ, দারুচিনি, তেজপাতা পরিমাণমতো, শুকনা মরিচ বাটা আড়াই চা চামচ, হলুদ বাটা আড়াই চা চামচ, লবণ পরিমাণমতো, কাজু বাদাম বাটা ১০০ গ্রাম, পেস্তা বাদাম বাটা ১০০ গ্রাম, পোলাওর চাল ১ কেজি, সয়াবিন তেল ২০০ গ্রাম, ঘি ১৫০ গ্রাম, গোলাপজল পরিমাণমতো, এলাচ, দারুচিনি, তেজপাতা পরিমাণমতো, আদা বাটা ৩ চা চামচ, রসুন বাটা ৩ চা চামচ, লবণ পরিমাণমতো, তরল দুধ ৫০০ মি.লি.।");
            tv2.setText("মুরগির সঙ্গে প্রয়োজনীয় মসলা ও উপাদান মিশিয়ে ১০ মিনিট ফ্রিজে (নরমাল) মেরিনেট করা হয়। পোলাও চালের সঙ্গে একে একে সব উপকরন যোগ করে ২০ মিনিট রান্না করা হয়। এরপর মেরিনেট করা মুরগির মাংস যোগ করে আরও ৫ মিনিট রান্না করা হয়।");
            im1.setBackgroundResource(R.drawable.rec_07);
            setTitle(R.string.rec_07);
        }
        else if(selector==8)
        {
            tv1.setText("উপকরণ–১ : মাংস চার কেজি, পেঁয়াজ (অর্ধেক বাটা, অর্ধেক কুঁচি) ২ কেজি, আদাবাটা ২০০ গ্রাম, রসুনবাটা ২০০ গ্রাম, সাদা সরিষাবাটা ৫০ গ্রাম, চিনাবাদামবাটা ৫০ গ্রাম, নারকেলবাটা ২০০ গ্রাম, ধনে গুঁড়া ২ টেবিল চামচ, জিরা গুঁড়া ২ টেবিল চামচ, মরিচ গুঁড়া ৩ টেবিল চামচ, হলুদ গুঁড়া ২ টেবিল চামচ, গরমমসলা পরিমাণ মতো, টমেটো ১ কেজি, সরিষার তেল আধা কেজি, ঘি ৩৫০ গ্রাম, কাঁচা মরিচ ১০টি ও লবণ পরিমাণমতো।\n" +
                    "উপকরণ-২ : জিরা ২০ গ্রাম, ধনে ১০ গ্রাম, রাঁধুনি ১৫ গ্রাম, শুকনা মরিচ ১০টি ও তেজপাতা ৮টি।\n" +
                    "উপকরণ-৩ : মুখ চেরা এলাচি ৬টি, দারুচিনি (২ ইঞ্চি) ৩টি, লবঙ্গ ৮টি, গোলমরিচ আধা টেবিল চামচ, মেথি ২ টেবিল চামচ, জায়ফল ১টি, জয়ত্রী ১ টেবিল চামচ, রাঁধুনি আধা টেবিল চামচ ও জৈন ১ চা-চামচ।");
            tv2.setText("মাংস টুকরা করে ধুয়ে পানি ঝরাতে হবে। গরম পানি ও কাঁচা মরিচ ছাড়া ১ নম্বর উপকরণের সব মসলা ও ২৫০ গ্রাম ঘি দিয়ে মাংস মেখে একটি ভারী সসপ্যানে নিয়ে চুলায় বসাতে হবে। ২ কাপ পানি দিয়ে নেড়ে দিতে হবে। ২ নম্বর উপকরণের মসলাগুলো ভেজে গুঁড়া করে মাংসে দিতে হবে। ঢাকনা দিয়ে চুলায় মাঝারি আঁচে রান্না করতে হবে। মাঝেমধ্যে নেড়ে দিতে হবে। পানি শুকিয়ে এলে একটু পানি গরম করে দিতে হবে। বেশি দেওয়া যাবে না। মাখা মাখা ঝোল রাখতে হবে। এর মধ্যে ৩ নম্বর উপকরণের মসলা ভেজে গুঁড়া করে রাখতে হবে। মাংস সেদ্ধ হয়ে ওপরে তেল ভেসে উঠলে কাঁচা মরিচ, ৩ নম্বর উপকরণের গুঁড়া মসলা ও ১০০ গ্রাম ঘি দিয়ে নেড়ে নামাতে হবে। সার্ভিং ডিসে মেজবানি মাংস নিয়ে ওপরে বেরেস্তা দিয়ে পরিবেশন করা যাবে।");
            im1.setBackgroundResource(R.drawable.rec_08);
            setTitle(R.string.rec_08);
        }
        else if(selector==9)
        {
            tv1.setText(" গরুর বিভিন্ন অংশের মাংস, কলিজা ও হাড় মিলিয়ে ৫ কেজি, পেঁয়াজকুচি ২ কাপ, আদাবাটা ৩ টেবিল-চামচ, রসুনবাটা ২ টেবিল-চামচ, লাল মরিচবাটা ৩ টেবিল-চামচ, জিরা গুঁড়া দেড় টেবিল-চামচ, ধনে গুঁড়া ১ টেবিল-চামচ, হলুদ গুঁড়া ২ টেবিল-চামচ, সাদা তিলবাটা ১ টেবিল-চামচ, পেঁয়াজবাটা আধা কাপ, সরিষা তেল আড়াই কাপ, মিষ্টি জিরাবাটা ১ চা-চামচ, রাঁধুনিবাটা ১ চা-চামচ, সরিষাবাটা ১ টেবিল-চামচ, পোস্তদানাবাটা ১ টেবিল-চামচ, তেজপাতা ৭-৮টি, এলাচ, দারচিনি ও লবঙ্গবাটা ১ টেবিল-চামচ, কাবাব চিনিবাটা ১ টেবিল-চামচ, জায়ফল-জয়ত্রিবাটা ১ চা-চামচ, গোলমরিচবাটা ১ চা-চামচ, মেথিবাটা ১ চা-চামচ, পানি ৪-৫ কাপ, লবণ স্বাদমতো।");
            tv2.setText("-তেলে পেঁয়াজকুচি লাল করে ভেজে গরম মসলা ছাড়া বাকি মসলা মাখিয়ে মাংস ঢেলে ভালোভাবে কষান।\n" +
                    "-আধা ঘণ্টা পর ৪-৫ কাপ গরম পানি দিয়ে ঢেকে দিন।\n" +
                    "-মাংস সেদ্ধ হয়ে এলে গরম মসলা দিয়ে কিছুক্ষণ ঢেকে রেখে নামিয়ে নিন। তৈরি আপনার মেজবানী মাংস!");
            im1.setBackgroundResource(R.drawable.rec_09);
            setTitle(R.string.rec_09);
        }
        else if(selector==10)
        {
            tv1.setText(" গরুর মাংস ১ কেজি, আম অথবা জলপাইয়ের ঝাল আচার ৩ টেবিল-চামচ, পাঁচফোড়ন আধা চা-চামচ, পেঁয়াজকুচি ১ কাপ, আদাবাটা ১ টেবিল-চামচ, রসুনবাটা ১ চা-চামচ, জিরাবাটা ১ চা-চামচ, সরিষাবাটা ১ টেবিল-চামচ, মরিচগুঁড়া ১ টেবিল-চামচ, হলুদগুঁড়া ১ চা-চামচ, লবণ স্বাদমতো, দারুচিনি ২ টুকরা, এলাচ ২টি, তেজপাতা ১টি, সরিষার তেল আধা কাপ, চিনি ১ চা-চামচ, কাঁচা মরিচ ৮-১০টি।");
            tv2.setText(" মাংস টুকরা করে ধুয়ে আচার ও কিছু কাঁচা মরিচ বাদে সব উপকরণ মেখে নিতে হবে। তেল গরম করে পাঁচফোড়নের ফোড়ন দিতে হবে। তাতে মাখানো মাংস ও পরিমাণমতো পানি দিয়ে অল্প আঁচে রান্না করতে হবে। মাংস সিদ্ধ হয়ে পানি শুকিয়ে গেলে আচার ও কাঁচা মরিচ দিয়ে কিছুক্ষণ চুলায় রেখে নামাতে হবে।");
            im1.setBackgroundResource(R.drawable.rec_10);
            setTitle(R.string.rec_10);
        }
        else if(selector==11)
        {
            tv1.setText("ক) উপকরণ : গরুর মাংস হাড়সহ এক কেজি, আদা বাটা এক টেবিল চামচ, রসুন বাটা আধা চা চামচ, মরিচ এক টেবিল চামচ, জিরা এক চা চামচ, ধনে বাটা এক টেবিল চামচ, টক দই আধা কাপ, এলাচ, দারুচিনি, লবঙ্গ, তেজপাতা তিন টুকরা, লবণ স্বাদমতো।\n" +
                    "\n" +
                    "যেভাবে তৈরি করবেন :\n" +
                    "১. ওপরের সব উপকরণ একত্রে মেখে মাংস ম্যারিনেট করে রাখুন চার ঘণ্টা।\n" +
                    "\n" +
                    "খ) উপকরণ : পেঁয়াজ রিং করে কাটা এক কাপ, পেঁয়াজ বাটা এক কাপের চার ভাগের এক ভাগ, গরম মসলা এক টেবিল চামচ, ঘন নারিকেল দুধ এক কাপ, ভিনেগার এক কাপের চার ভাগের এক ভাগ, টমেটো সস আধা কাপ, চিনি এক চা চামচ, কাঁচা মরিচ পাঁচটি, জায়ফল আধা চা চামচ, জয়ত্রী আধা চা চামচ, তেল আধা কাপ।");
            tv2.setText("১. মোটা কড়াইতে তেল গরম করে রসুন কুচি লাল করে ভেজে নিন। এরপর বাটা পেঁয়াজ দিন।\n" +
                    "২. ম্যারিনেট করে রাখা মাংস ঢেলে মৃদু আঁচে কষান।\n" +
                    "৩. মাংসের মধ্যে ভিনেগার ঢেলে দিন।\n" +
                    "৪. মাংস আশি ভাগ সিদ্ধ হলে নারিকেল দুধ ঢেলে দিন। এরপর রিং করে কেটে রাখা পেঁয়াজ ঢেলে দিন।\n" +
                    "৫. মাংস সিদ্ধ হলে ৩০ মিনিট দমে রেখে নামিয়ে পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_11);
            setTitle(R.string.rec_11);
        }
        else if(selector==12)
        {
            tv1.setText("মাংসের পাতলা টুকরা ৬ পিস, সরিষা বাটা ২ টেবিল চামচ, ওয়েস্টার সস ২ টেবিল চামচ, লবণ পরিমাণমতো, গোলমরিচ পরিমাণ মতো, আদা বাটা ১ টেবিল চামচ, রসুন বাটা ১ টেবিল চামচ, গুঁড়া মরিচ ১ টেবিল চামচ, টক দই ২ টেবিল চামচ।");
            tv2.setText("মাংস কাটতে হবে হাড় ছাড়া। তারপর সব উপকরণ দিয়ে ম্যারিনেট করতে হবে। গ্রিলের ওপর দিয়ে দুই পাশই গ্রিল করতে হবে বাদামি রঙ না হওয়া পর্যন্ত। তারপর পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_12);
            setTitle(R.string.rec_12);
        }
        else if(selector==13)
        {
            tv1.setText("মাংসের পাতলা টুকরা ৬ পিস, সরিষা বাটা ২ টেবিল চামচ, ওয়েস্টার সস ২ টেবিল চামচ, লবণ পরিমাণমতো, গোলমরিচ পরিমাণ মতো, আদা বাটা ১ টেবিল চামচ, রসুন বাটা ১ টেবিল চামচ, গুঁড়া মরিচ ১ টেবিল চামচ, টক দই ২ টেবিল চামচ।");
            tv2.setText(" মাংস কাটতে হবে হাড় ছাড়া। তারপর সব উপকরণ দিয়ে ম্যারিনেট করতে হবে। গ্রিলের ওপর দিয়ে দুই পাশই গ্রিল করতে হবে বাদামি রঙ না হওয়া পর্যন্ত। তারপর পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_01);
            setTitle(R.string.rec_13);
        }
        else if(selector==14)
        {
            tv1.setText("ভ্যানিলা আইসক্রিম ২ স্কুপ, দুধ ১০০ গ্রাম, জেলি ১০ গ্রাম লাল এবং ১০ গ্রাম সবুজ, মিক্সড ফ্রুটস ১০০ গ্রাম, ফালুদা নুডলস ১৫০ গ্রাম, কাজু বাদাম ১০ গ্রাম, কিশমিশ ১০ গ্রাম।");
            tv2.setText("একটি বড় গ্গ্নাসে আধা গ্গ্নাস পরিমাণ জেলি, নুডলস, আবার জেলি, দুধ, ১ স্কুপ আইসক্রিম, ফ্রুটস, আবার ১ স্কুপ আইসক্রিম ওপরে ডেকোরেশনের জন্য কিশমিশ ও কাজু বাদাম কুচি কুচি করে ওপরে ছিটিয়ে পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_14);
            setTitle(R.string.rec_14);
        }
        else if(selector==15)
        {
            tv1.setText("দুধ ৫ কেজি, চিনি ১৫০ গ্রাম, পেস্তা বাদাম ১০ গ্রাম (ডেকোরেশনের জন্য)।");
            tv2.setText("দুধ জাল দেওয়ার পর উপরিভাগে যে সর জমবে তা আসতে আসতে সাইড করতে হবে। দুধ শুকিয়ে এলে চিনি দিয়ে ভালো করে মিশিয়ে নিন, একটি বোলে ঢেলে পেস্তা বাদাম কুচি কুচি করে ওপরে ছিটিয়ে ঠাণ্ডা করুন এবং পরিবেশন করুন মজাদার রাবড়্রি।");
            im1.setBackgroundResource(R.drawable.rec_15);
            setTitle(R.string.rec_15);
        }
        else if(selector==16)
        {
            tv1.setText("খাসির মাংস ১ কেজি, সয়াবিন তেল ১০০ গ্রাম, পেঁয়াজ কুচি ১০০ গ্রাম, আদা বাটা ৫০ গ্রাম, রসুন বাটা ৫০ গ্রাম, হলুদ গুঁড়া ২০ গ্রাম, মরিচ গুঁড়া ২০ গ্রাম, জিরা গুঁড়া ২০ গ্রাম, ধনিয়া গুঁড়া ২০ গ্রাম, টমেটো কুচি ১০০ গ্রাম, টক দই ১০০ গ্রাম এবং লং, এলাচ, দারুচিনি, লবণ ও তেজপাতা পরিমাণমতো।");
            tv2.setText("একটি পাত্রে খাসির মাংস দিয়ে ওই মাংসে পেঁয়াজ, আদা, রসুন, হলুদ, মরিচ, জিরা, ধনিয়া, লবণ, টমেটো, দই, গরম মসলা, তেল দিয়ে মাংস ভুনতে হবে। মাংস ১০ থেকে ১৫ মিনিট ভুনার পর যখন শুকিয়ে আসতে থাকবে তখন এর মধ্যে পরিমাণমতো পানি দিতে হবে এবং ঢেকে দিতে হবে, যেন মাংস তাড়াতাড়ি সিদ্ধ হয়। আধা ঘণ্টা পর ঢাকনা খুলে চুলার আঁচ কিছুটা বাড়িয়ে দিতে হবে, যেন মাংসের পানি শুকিয়ে একটু ঘন হয়। মাংস সিদ্ধ হয়ে গেলে পাত্রে ঢেলে ওপরে ভাজা পেঁয়াজ দিয়ে পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_16);
            setTitle(R.string.rec_16);
        }
        else if(selector==17)
        {
            tv1.setText("গরুর মাংস আড়াই কেজি, পেঁয়াজ (মিহি কুচি) আধা কেজি, আদা বাটা ২ টেবিল চামচ, তেজপাতা ২টি, দারুচিনি ছয় টুকরা, এলাচি (ছোট) ৬টি, লবণ স্বাদ অনুযায়ী, সিরকা আড়াই টেবিল চামচ, তেল সিকি কাপ।");
            tv2.setText("মাংস বড় টুকরা করে কেটে ধুয়ে নিন। হাঁড়ি বা কড়াইয়ে তেল গরম হলে তেজপাতার ফোড়ন দিয়ে পেঁয়াজ বাদামি করে ভেজে নিন। মাংসের টুকরাগুলো দিয়ে কিছুক্ষণ ভাজুন। সিরকা ও লবণ দিয়ে আরও কিছুক্ষণ ভেজে আদা বাটা দিয়ে কষিয়ে নিন। চুলার আঁচ কমিয়ে ঢেকে দিন। ভালোভাবে জ্বাল হলে মাংসের পানি বের হবে। কিন্তু নরম হবে না। মাংস চুলা থেকে নামিয়ে রাখুন। গরমের দিন হলে প্রতিদিন এবং শীতের দিন হলে এক দিন অন্তর জ্বাল দেবেন অল্প আঁচে। প্রয়োজনে সামান্য পানি দিয়ে জ্বাল দেবেন। যদি রেফ্রিজারেটরে রাখা হয়, তাহলে পাঁচ দিন পর পর জ্বাল দেবেন। মাংস ফুটিয়ে জ্বাল দিতে হবে। ভালো করে ঝুরি হয়ে ভাজা ভাজা হলে এই মাংস একটি বায়ুরোধী পাত্রে করে ফ্রিজে এক থেকে দুই মাস পর্যন্ত রেখে খাওয়া যায়। খাওয়ার আগে বের করে পেঁয়াজ বাদামি করে ভেজে কাঁচা মরিচ কুচি দিয়ে নেড়ে বাগার দিয়ে খেতে পারেন।");
            im1.setBackgroundResource(R.drawable.rec_17);
            setTitle(R.string.rec_17);
        }
        else if(selector==18)
        {
            tv1.setText("গরুর মাস ১ কেজি, পেঁয়াজ কুচি দেড় কাপ, আদা বাটা ১ টেবিল চামচ, রসুন বাটা ১ চা-চামচ, লবণ স্বাদমতো, গোলমরিচ বাটা ১ চা-চামচ, জিরা বাটা ১ চা-চামচ, ধনে বাটা ১ চা-চামচ, বাদাম বাটা আধা চা-চামচ, হলুদ গুঁড়া আধা চা-চামচ, মরিচ গুঁড়া আধা চা-চামচ, মরিচ গুঁড়া ১ চা-চামচ, সরষে বাটা আধা চা-চামচ, এলাচি-দারুচিনি-লবঙ্গ কয়েকটা, তেজপাতা ৩-৪টা, তেল ১ কাপ, গরম মসলা গুঁড়া আধা চা-চামচ।");
            tv2.setText("তেলে আধা কাপ পেঁয়াজ কুচি বাদামি করে ভেজে সব মসলা কষিয়ে মাংস দিয়ে দিতে হবে। আন্দাজমতো পানি দিয়ে মাংস সেদ্ধ করে নিতে হবে। মাংসের পানি শুকিয়ে গেলে নামিয়ে নিতে হবে। এবার মাংস নেড়েচেড়ে ঝুরা করে নিতে হবে। অল্প তেলে ১ কাপ পেঁয়াজ বাদামি করে ভেজে ঝুরা মাংস দিয়ে নাড়তে হবে। ভাজা ভাজা হয়ে গেলে গরম মসলা ও গোলমরিচের গুঁড়া দিয়ে নামিয়ে নিতে হবে।");
            im1.setBackgroundResource(R.drawable.rec_18);
            setTitle(R.string.rec_18);
        }
        else if(selector==19)
        {
            tv1.setText("ময়দা ৪ কাপ, চিনি ১ কাপ, ঘি ২-৩ টেবিল চামচ, পানি ১ কাপ, লবণ ১ চা-চামচ, চিনি গুঁড়া আধা কাপ, গুঁড়া দুধ ৩ টেবিল চামচ, পানি পরিমাণমতো, মাখন আধা কাপ।");
            tv2.setText(" একটি বাটিতে ময়দা, তেল, চিনি, গুঁড়া দুধ নিয়ে পানি দিয়ে ভালোভাবে মেখে নিতে হবে। সামান্য ঘি মেখে ১ ঘণ্টা ঢেকে রাখতে হবে। রুটি বেলে গলানো মাখন লাগিয়ে চার ভাঁজ করে ১৫-২০ মিনিট রেখে দিতে হবে। এরপর চার কোনা একসঙ্গে করে গোলভাবে আবার রুটি বেলতে হবে। প্রি-হিট ওভেনে ২০০ ডিগ্রি সেলসিয়াস তাপে ৮ মিনিট বেক করে নিতে হবে অথবা ননস্টিক প্যানে সামান্য মাখনে ভেজে নিতে হবে। চিনি ও পানি জ্বাল দিয়ে সিরা তৈরি করে নিতে হবে। ভাজা বাকরখানি সিরায় দিয়ে তুলে নিতে হবে। গরম গরম মাংসের সঙ্গে পরিবেশন করতে হবে।");
            im1.setBackgroundResource(R.drawable.rec_19);
            setTitle(R.string.rec_19);
        }
        else if(selector==20)
        {
            tv1.setText("বাসমতি চাল ১ কেজি, খাসির মাংস (ছোট টুকরো করে কাটা) ২ কেজি, পেঁয়াজ কুঁচি ৭টি, আদা রসুন বাটা ২ চা চামচ, গরম মশলা গুঁড়া ১ চা চামচ, শুকনা মরিচ ৫টি, দারুচিনি ৩ টুকরো, দই ২ কাপ (ফেটানো), এলাচ ৫টি, গোল মরিচ ৮টি, লবঙ্গ ৮টি, শাহীজিরা ১ চা চামচ, হলুদ গুঁড়া আধা চা চামচ, জাফরান সামান্য সঙ্গে আধা কাপ দুধ, ধনে বা পুদিনাপাতা কুঁচি ১ চা চামচ, আলুবোখারা, কিসমিস, বাদাম, শুকনো ফল, ঘি, লবণ স্বাদ মতো।");
            tv2.setText("পাত্রে ঘি গরম করে আলুবোখারা, কিসমিস, বাদাম, শুকনো ফল একটু লবণ দিয়ে ভেজে তুলুন। এবার পেঁয়াজ বেরেস্তা করে নিন। দই, আদা পেঁয়াজ-রসুন-পেস্ট, হলুদ গুঁড়া ও লবণ দিয়ে মাংস মেরিনেট করে রাখুন। একটি পাত্রে ঘি গরম করে মাংস দিয়ে রান্না করুন। এবার অন্য একটি পাত্রে ঘি গরম করে গোটা মশলাগুলো কিছুক্ষণ ভেজে চাল দিন। এখন লবণ দিয়ে পরিমাণ মতো গরম পানি দিয়ে পোলাও রান্না করুন। লক্ষ রাখবেন যেন পোলাও কিছুটা কম সিদ্ধ হয়। বড় একটি পাত্রে প্রথমে কিছু পোলাও তারপর মাংস দিয়ে একটু একটু গরম মসলার গুঁড়া দিন, এভাবে কয়েকটি লেয়ার করুন। জাফরান ভেজানো দুধ দিয়ে দিন। সবশেষে ভাজা আলুবোখারা, কিসমিস, বাদাম, শুকনো ফল দিন এবার ২০ মিনিটের জন্য চুলার আচঁ কমিয়ে পাত্রের মুখে ঢাকনা দিয়ে ঢেকে রাখুন। নওয়াবি বিরিয়ানি সার্ভিং ডিশে তুলে ওপরে ধনে বা পুদিনাপাতা কুঁচি ছড়িয়ে গরম গরম পরিবেশন করুন।");
            im1.setBackgroundResource(R.drawable.rec_20);
            setTitle(R.string.rec_20);
        }

    }
}
